{
  "header": {
    "about": "Обо мне",
    "growth": "Рост",
    "education": "Образование",
    "projects": "Проекты"
  },
  "informationCard": {
    "name": "Кокиш Амир",
    "role": "Фронтенд разработчик",
    "location": "Астана, Казахстан"
  },
  "followMe": {
    "title": "Подписывайтесь на меня",
    "copied": "Скопировано!",
    "copyDescription": "Письмо скопировано в буфер обмена."
  },
  "contentPageAbout": {
    "title": "Обо мне",
    "textAbout1": "Фронтенд-разработчик с опытом более одного года в создании современных веб-приложений и интерфейсов. Умею выполнять полный цикл клиентской разработки — от адаптивной вёрстки до интеграции с сервером и оптимизации производительности. Уверенно владею JavaScript/TypeScript, React, Next.js и современными инструментами разработки.",
    "textAbout2": "Отличаюсь вниманием к деталям, хорошо понимаю принципы UX/UI и умею превращать идеи в удобные, масштабируемые и эстетичные интерфейсы. Эффективно работаю как самостоятельно, так и в распределённых командах, соблюдая лучшие практики в области кода, тестирования и контроля версий. Стремлюсь к постоянному развитию и созданию решений, которые приносят реальную пользу пользователям.",
    "ProfessionalSkills": "Профессиональные навыки",
    "skills": [
      "Фронтенд-разработка: React, Next.js, TypeScript, JavaScript (ES6+)",
      "Управление состоянием: React Hooks, Context API",
      "Интеграция с REST API и backend-сервисами",
      "Оптимизация производительности (ленивая загрузка, разделение кода, кеширование)",
      "Современные стили: Tailwind CSS, SCSS, Ant Design, Material UI",
      "UX/UI-принципы: чистые макеты, доступность, ориентация на пользователя",
      "Архитектура компонентов и переиспользуемые UI-паттерны",
      "Контроль версий и командная работа: Git, GitHub",
      "Аутентификация и авторизация (вход, сессии)",
      "Анимации и интерактивность: Framer Motion, GSAP, CSS-переходы"
    ],
    "Toolset": "Набор инструментов"
  },
  "contentPageGrowth": {
    "title": "Путь роста",
    "text1": "Это история о том, как шаг за шагом я построил карьеру в IT, начав с обычного студента. Здесь я делюсь своим путём: от первого понимания, что такое интернет, до официального трудоустройства в качестве фронтенд-разработчика. Эта история отражает мой опыт, дисциплину и постоянное развитие, которое продолжается и сегодня.",
    "scrollDown": "Прокрутите вниз",
    "texts": [
      "История моей карьеры как фронтенд-разработчика",
      "Я был обычным студентом колледжа. Всё изменилось 7 января 2024 года, когда я принял серьёзное решение посвятить себя программированию и впервые пришёл в офис, где начал обучение. С того момента моя жизнь стала дисциплинированной и насыщенной: каждое утро я вставал в 7, учился в колледже с 8:30 до 13:40 (иногда до 15:20), а сразу после занятий шёл в офис, где проводил ещё 5–6 часов, полностью погружённый в код. Так продолжалось почти девять месяцев подряд.",
      "Мой путь был постепенным и последовательным.",
      "В первый месяц я заложил основу: изучал Интернет, HTTP, доменные имена, хостинг и принципы работы веба. Уже после первого дня приступил к практике с HTML и CSS, а спустя месяц активной вёрстки начал изучать JavaScript.",
      "В течение 4–5 месяцев я читал сайт javascript.info, решал задачи на Codewars и развивал алгоритмическое мышление.",
      "Далее я освоил Git/GitHub, npm, а затем такие инструменты, как Tailwind CSS.",
      "Следующий этап был ещё интереснее. Я погрузился в React, одновременно изучая React Router, познакомился с концепцией SSR (Server Side Rendering) и начал работать с Next.js. Это дало понимание того, как строятся современные веб-приложения.",
      "Позже я освоил TypeScript, начал изучать дизайн-системы и правильные подходы к созданию интерфейсов. На практике я пробовал разворачивать проекты — использовал GitHub Pages и другие способы публикации приложений.",
      "7 сентября 2024 года я официально устроился на работу фронтенд-разработчиком. Но это не конец моего пути. Каждый день я продолжаю учиться и совершенствовать навыки. Моя цель — стать фулстек-разработчиком. Далее я планирую углубиться в бэкенд и базы данных, чтобы создавать проекты от начала до конца.",
      "Моя история — пример того, как дисциплина, настойчивость и ежедневная практика могут за короткое время превратить студента в профессионала. И это только начало."
    ],
    "returnToTop": "Вернуться наверх",
    "education": "Образование"
  },
  "contentPageEducation": {
    "title": "Образование",
    "iStudyAt": "Я учусь в",
    "certifications": "Сертификаты",
    "collegeName": "Астанинский Политехнический Колледж",
    "collegeSpecialty": "Разработчик программного обеспечения · 2022–2025",
    "certPythonTop": "Программирование на Python · Championika Digital",
    "certPythonBottom": "Апрель 2023",
    "certRedHatTop": "Системное администрирование I (RH124) · Red Hat",
    "certRedHatBottom": "Декабрь 2024",
    "certCiscoTop": "Основы ИТ: Аппаратное и программное обеспечение ПК · Cisco Networking Academy",
    "certCiscoBottom": "Май 2024",
    "text": "Я начал путь фронтенд-разработчика как самоучка, изучая веб-технологии по курсам, учебникам и документации. Со временем я освоил HTML, CSS, JavaScript и фреймворки, такие как React. Большинство навыков я получил через практику — создавая проекты, решая реальные задачи и постоянно осваивая новые инструменты, чтобы идти в ногу с индустрией."
  },
  "contentPageProject": {
    "title": "Проекты",
    "titleSounbloom": "Soundbloom",
    "titleKinotower": "Kinotower",
    "textKinotower": "KinoTower — это веб-приложение о фильмах, где можно просматривать описания и постеры, искать нужный фильм и быстро находить всю информацию о нём в одном месте.",
    "textSoundbloom": "SoundBloom — это современное веб-приложение, созданное на React в минималистичном стиле. Оно позволяет слушать треки прямо в браузере, создавать атмосферу прослушивания и добавлять собственные композиции.",
    "processRevision": "Доработка",
    "processCompleted": "Завершён",
    "processNotCompleted": "Не завершён",
    "visit": "Перейти"
  },
  "mobile_warning": "Сайт пока что в разработке для смартфонов и планшетов. Пожалуйста, откройте его с компьютера."
}