{
  "header": {
    "about": "Мен туралы",
    "growth": "Өсу",
    "education": "Білімі",
    "projects": "Жобалар"
  },
  "informationCard": {
    "name": "Кокіш Амир",
    "role": "Фронтенд әзірлеушісі",
    "location": "Астана, Қазақстан"
  },
  "followMe": {
    "title": "Маган жазыл",
    "copied": "Көшірілген!",
    "copyDescription": "Хат алмасу буферіне көшірілді."
  },
  "contentPageAbout": {
    "title": "",
    "textAbout": "",
    "ProfessionalSkills": "",
    "ProfessionalSkillsText": "",
    "Toolset": ""
  },
  "contentPageAbout": {
    "title": "Мен туралы",
    "textAbout1": "1 жылдан астам тәжірибесі бар фронтенд-әзірлеуші. Заманауи веб-қосымшалар мен интерфейстерді жасай аламын. Клиенттік әзірлеудің толық циклін орындай аламын — бейімделгіш вёрсткадан бастап backend-интеграция мен өнімділікті оңтайландыруға дейін. JavaScript/TypeScript, React, Next.js және заманауи әзірлеу құралдарын сенімді меңгергенмін.",
    "textAbout2": "Мен ұқыптылығыммен ерекшеленемін, UX/UI қағидаларын жақсы түсінемін және идеяларды ыңғайлы, масштабталатын әрі әдемі интерфейстерге айналдыра аламын. Тәуелсіз де, командада да тиімді жұмыс істеймін, код жазу, тестілеу және нұсқаларды бақылауда ең жақсы тәжірибелерді ұстанамын. Үздіксіз дамуға және пайдаланушыларға нақты пайда әкелетін шешімдер жасауға ұмтыламын.",
    "ProfessionalSkills": "Кәсіби дағдылар",
    "skills": [
      "Фронтенд-әзірлеу: React, Next.js, TypeScript, JavaScript (ES6+)",
      "Күйді басқару: React Hooks, Context API",
      "REST API және backend-қызметтерімен біріктіру",
      "Өнімділікті оңтайландыру (lazy loading, code splitting, кэштеу)",
      "Заманауи стильдер: Tailwind CSS, SCSS, Ant Design, Material UI",
      "UX/UI қағидалары: таза дизайн, қолжетімділік, пайдаланушыға бағытталу",
      "Компонент архитектурасы және қайта пайдаланылатын UI-үлгілер",
      "Нұсқаларды басқару және бірлескен жұмыс: Git, GitHub",
      "Аутентификация және авторизация (кіру, сессиялар)",
      "Анимациялар және интерактивтілік: Framer Motion, GSAP, CSS-өту эффектілері"
    ],
    "Toolset": "Құралдар жинағы"
  },
  "contentPageGrowth": {
    "title": "Өсу жолы",
    "text1": "Бұл — қарапайым студенттен IT саласында мансапқа дейінгі менің өсу тарихым. Мұнда мен өз жолымды бөлісемін: интернетті алғаш түсінген сәттен бастап фронтенд-әзірлеуші ретінде ресми жұмысқа орналасуға дейін. Бұл оқиға менің тәжірибемді, тәртібімді және бүгінге дейін жалғасып келе жатқан үздіксіз дамуды сипаттайды.",
    "scrollDown": "Төмен айналдырыңыз",
    "texts": [
      "Фронтенд-әзірлеуші ретінде менің мансап тарихым",
      "Мен қарапайым колледж студенті едім. Барлығы 2024 жылдың 7 қаңтарында өзгерді — мен бағдарламалауға толықтай берілуге шешім қабылдап, алғаш рет офиске келіп, оқуды бастадым. Сол күннен бастап өмірім тәртіпке келді және мазмұнды болды: әр таң сайын 7-де тұрып, 8:30-дан 13:40-қа дейін (кейде 15:20-ға дейін) колледжде оқыдым, ал сабақтан кейін бірден офиске барып, тағы 5–6 сағат кодқа толықтай шоматынмын. Бұл осылай дерлік тоғыз ай бойы жалғасты.",
      "Менің жолым біртіндеп әрі жүйелі болды.",
      "Алғашқы айда мен негіз қаладым: Интернет, HTTP, домендік атаулар, хостинг және вебтің жұмыс істеу қағидаларын үйрендім. Бірінші күннен кейін-ақ HTML және CSS арқылы тәжірибе жасай бастадым, ал бір ай белсенді вёрсткадан кейін JavaScript-ке көштім.",
      "4–5 ай бойы javascript.info сайтынан оқып, Codewars-та тапсырмалар шешіп, алгоритмдік ойлауды дамыттым.",
      "Келесі қадамда Git/GitHub, npm және Tailwind CSS сияқты құралдарды меңгердім.",
      "Келесі кезең одан да қызықты болды. React-ті терең үйреніп, сол уақытта React Router мен SSR (Server Side Rendering) тұжырымдамасымен танысып, Next.js-пен жұмыс істей бастадым. Осы арқылы заманауи веб-қосымшалардың қалай құрылатынын түсіндім.",
      "Кейінірек TypeScript тілін меңгеріп, дизайн жүйелерін және интерфейс жасаудың дұрыс тәсілдерін үйрендім. Тәжірибеде жобаларды орналастыруды сынадым — GitHub Pages және басқа жариялау тәсілдерін қолдандым.",
      "2024 жылдың 7 қыркүйегінде мен ресми түрде фронтенд-әзірлеуші болып жұмысқа орналастым. Бірақ бұл менің жолымның соңы емес. Күн сайын үйреніп, өзімді дамытуды жалғастырып келемін. Менің мақсатым — фулстек-әзірлеуші болу. Келесі қадам — backend пен дерекқорларды терең меңгеру және жобаларды толықтай өзім жасау.",
      "Менің тарихым — тәртіп, табандылық және күнделікті тәжірибе студентті қысқа уақытта нағыз маманға айналдыра алатынын дәлелдейді. Ал бұл — тек бастамасы."
    ],
    "returnToTop": "Жоғары қайту",
    "education": "Білім"
  },
  "contentPageEducation": {
    "title": "Білім",
    "iStudyAt": "Мен оқимын",
    "certifications": "Сертификаттар",
    "collegeName": "Астана Политехникалық Колледжі",
    "collegeSpecialty": "Бағдарламалық жасақтама әзірлеушісі · 2022–2025",
    "certPythonTop": "Python бағдарламалау · Championika Digital",
    "certPythonBottom": "2023 жылғы сәуір",
    "certRedHatTop": "Жүйелік әкімшілендіру I (RH124) · Red Hat",
    "certRedHatBottom": "2024 жылғы желтоқсан",
    "certCiscoTop": "IT Essentials: ДК аппараттық және бағдарламалық қамтамасыз ету негіздері · Cisco Networking Academy",
    "certCiscoBottom": "2024 жылғы мамыр",
    "text": "Мен фронтенд-әзірлеуші ретінде өз бетіммен оқып бастадым, веб-технологияларды курстар, оқулықтар және құжаттамалар арқылы үйрендім. Уақыт өте келе HTML, CSS, JavaScript және React сияқты фреймворктерді меңгердім. Негізгі дағдыларды тәжірибе арқылы алдым — жобалар жасап, нақты мәселелерді шешіп және жаңа құралдарды үнемі үйреніп, индустриямен бірге дамып келемін."
  },
  "contentPageProject": {
    "title": "Жобалар",
    "titleSounbloom": "Soundbloom",
    "titleKinotower": "Kinotower",
    "textKinotower": "KinoTower — бұл фильмдер туралы веб-қосымша. Мұнда сіз фильм сипаттамаларын және постерлерін көре аласыз, қажет фильмді іздеп, барлық ақпаратты бір жерден таба аласыз.",
    "textSoundbloom": "SoundBloom — React негізінде жасалған заманауи және минималистік веб-қосымша. Ол арқылы браузерде тікелей тректерді тыңдап, атмосфера құрып, өз композицияларыңызды қоса аласыз.",
    "processRevision": "Жаңарту үстінде",
    "processCompleted": "Аяқталған",
    "processNotCompleted": "Аяқталмаған",
    "visit": "Көру"
  },
  "mobile_warning": "Сайт әлі мобильді құрылғылар үшін әзірленіп жатыр. Компьютерден ашыңыз."
}