{
  "header": {
    "about": "About",
    "growth": "Growth",
    "education": "Education",
    "projects": "Projects"
  },
  "informationCard": {
    "name": "Kokish Amir",
    "role": "Frontend Developer",
    "location": "Astana, Kazakhstan"
  },
  "followMe": {
    "title": "Follow me",
    "copied": "Copied!",
    "copyDescription": "The mail has been copied to the clipboard."
  },
  "contentPageAbout": {
    "title": "About Me",
    "textAbout1": "Frontend developer with over 1 year of experience in creating modern web applications and interfaces. I am able to run a full cycle of client development, from adaptive layout to backend integration and performance optimization. I am confident in JavaScript/TypeScript, React, Next.js and modern development tools.",
    "textAbout2": "I am distinguished by my attention to detail, I understand the principles of UX/UI well, and I am able to turn ideas into user-friendly, scalable, and aesthetic interfaces. I work effectively both independently and in distributed teams, adhering to the best practices in code, testing and version control. I strive for continuous development and creation of solutions that bring real value to users.",
    "ProfessionalSkills": "Professional Skills",
    "skills": [
      "Frontend development: React, Next.js, TypeScript, JavaScript (ES6+)",
      "State management: React Hooks, Context API",
      "Integration with REST APIs & backend services",
      "Performance optimisation (lazy loading, code splitting, caching)",
      "Modern styling: Tailwind CSS, SCSS, Ant Design, Material UI",
      "UX/UI principles: clean layouts, accessibility, user-focused design",
      "Component architecture & reusable UI patterns",
      "Version control & collaboration: Git, GitHub",
      "Authentication & authorisation flows (login, sessions)",
      "Animation & interactivity: Framer Motion, GSAP, CSS transitions"
    ],
    "Stack": "Stack"
  },
  "contentPageGrowth": {
    "title": "Growth",
    "text1": "This is the story of how, step by step, I built a career in IT from an ordinary student. Here I share my journey: from my first understanding of the internet to my official employment as a front-end developer. This story explores my experience, discipline, and ongoing development, which continues to this day.",
    "scrollDown": "Scroll down",
    "texts": [
      "The story of my career as a frontend developer",
      "I was an ordinary college student. Everything changed on January 7, 2024, when I made a serious decision to devote myself to programming and came to the office for the first time, where I began my studies. From that moment on, my life became disciplined and eventful: every morning I got up at 7, studied at college from 8:30 to 1:40 p.m. (sometimes until 3:20 p.m.), and immediately after classes I went to the office, where I spent another 5-6 hours completely immersed in code. It went on like this every day for almost nine months.",
      "My journey has been gradual and consistent.",
      "In the first month, I laid the foundation: I studied the Internet, HTTP, domain names, hosting, and the principles of the web. After the first day, I started practicing with HTML and CSS, and after a month of active layout, I started learning JavaScript.",
      "For 4-5 months I have been reading javascript.info, solved problems on Codewars and strengthened algorithmic thinking.",
      "Next, I mastered Git/GitHub, npm, and then tools such as Tailwind CSS.",
      "The next stage was even more interesting. I immersed myself in React, studied the React Router at the same time, and also got acquainted with the concept of SSR (Server Side Rendering) and started working with Next.js. This provided an understanding of how modern web applications are built.",
      "Later, I mastered TypeScript, began to study design systems and the right approaches to creating interfaces. In practice, I tried to deploy projects — I used GitHub Pages and other ways to publish applications.",
      "On September 7, 2024, I officially got a job as a frontend developer. But this is not the end of my journey. Every day I continue to learn and improve my skills. My goal is to become a fullstack developer. Next, I plan to delve into the backend and databases in order to create projects from start to finish.",
      "My story is an example of how discipline, perseverance, and daily practice can transform a student into a professional in a short time. And this is just the beginning."
    ],
    "returnToTop": "Return to top",
    "education": "Education"
  },
  "contentPageEducation": {
    "title": "Education",
    "iStudyAt": "I study at",
    "certifications": "Certifications",
    "collegeName": "Astana Polytechnic College",
    "collegeSpecialty": "Software developer · 2022–2025",
    "certPythonTop": "Python programming · Championika Digital",
    "certPythonBottom": "Apr 2023",
    "certRedHatTop": "System Administration I (RH124) · Red Hat",
    "certRedHatBottom": "Dec 2024",
    "certCiscoTop": "IT Essentials: PC Hardware and Software · Cisco Networking Academy",
    "certCiscoBottom": "May 2024",
    "text": "I began my front-end development journey as a self-taught developer, learning web technologies from courses, tutorials, and documentation. Over time, I mastered HTML, CSS, JavaScript, and frameworks like React. I gained most of my skills through hands-on experience—creating projects, solving real-world problems, and constantly learning new tools to stay up-to-date with the industry."
  },
  "contentPageProject": {
    "title": "Project",
    "titleSounbloom": "Sounbloom",
    "titleKinotower": "Kinotower",
    "textKinotower": "KinoTower is a web app about movies where you can view descriptions and posters, search for the movie you need, and easily find information about the movie in one place.",
    "textSoundbloom": "SoundBloom is a modern web app built with React and a minimalist approach that lets you listen to tracks directly in your browser, create a listening environment, and then add your own compositions.",
    "processRevision": "Revision",
    "processCompleted": "Completed",
    "processNotCompleted": "Not completed",
    "visit": "Visit"
  }
}
